test_cases/sqDuct/nnfoam_inputs/data/foam_synthetic_truth/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 1 0 0 );

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    leftWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    topSym
    {
        type            symmetryPlane;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
